meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pServer/STM32_WPAN/App/app_ble.c
  /* USER CODE BEGIN APP_BLE_Init_3 */
  /* CUSTOM DATA SERVICE BAŞLATMA
     *
     * Bu kod bloğu ne yapar?
     * 1. Custom servisi başlatır
     * 2. Hata kontrolü yapar
     * 3. Event handler'ı kaydeder
     * 4. Debug mesajı yazdırır
     */
    APP_DBG_MSG("Custom Data Service başlatılıyor...\n");

    tBleStatus custom_ret = CustomDataService_Init();
    if (custom_ret != BLE_STATUS_SUCCESS) {
        APP_DBG_MSG("HATA: Custom Data Service başlatılamadı: 0x%x\n", custom_ret);
        // Error_Handler(); // Opsiyonel: Sistem durdur
    } else {
        APP_DBG_MSG("✓ Custom Data Service başarıyla başlatıldı\n");
    }

    /*
     * EVENT HANDLER KAYDETME
     *
     * SVCCTL_RegisterSvcHandler nedir?
     * - Service Controller'a event handler kaydeder
     * - BLE event'leri geldiğinde bizim fonksiyonumuzu çağırır
     * - Örnek: Client yazdı → CustomDataService_Event_Handler çalışır
     */
    SVCCTL_RegisterSvcHandler(CustomDataService_Event_Handler);
    APP_DBG_MSG("✓ Custom Data Service event handler kaydedildi\n");

  /* USER CODE END APP_BLE_Init_3 */

  /**
   * Create timer to handle the Advertising Stop
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Cancel_Req);
  /**
   * Create timer to handle the Led Switch OFF
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);

  /**
   * Make device discoverable
   */
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;

  /* Initialize intervals for reconnexion without intervals update */
  AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
  AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;

  /**
   * Start to Advertise to be connected by P2P Client
   */
  Adv_Request(APP_BLE_FAST_ADV);

  /* USER CODE BEGIN APP_BLE_Init_2 */
  // Initialize name change system

  Update_Device_Name_With_Counter();




  // Create timer for system reset
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &Reset_timer_Id, hw_ts_SingleShot, Reset_System_Timeout);

  // Register tasks

  UTIL_SEQ_RegTask(1<<CFG_TASK_SYSTEM_RESET_ID, UTIL_SEQ_RFU, Process_System_Reset);

  // Start the reset timer (1 minute)
  HW_TS_Start(Reset_timer_Id, (60*1000*1000/CFG_TS_TICK_VAL));
  /* USER CODE END APP_BLE_Init_2 */

  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  hci_event_pckt    *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;
  uint8_t           Tx_phy, Rx_phy;
  tBleStatus        ret = BLE_STATUS_INVALID_PARAMS;
  hci_le_connection_complete_event_rp0        *p_connection_complete_event;
  hci_disconnection_complete_event_rp0        *p_disconnection_complete_event;
  hci_le_phy_update_complete_event_rp0        *p_evt_le_phy_update_complete;
#if (CFG_DEBUG_APP_TRACE != 0)
  hci_le_connection_update_complete_event_rp0 *p_connection_update_complete_event;
#endif /* CFG_DEBUG_APP_TRACE != 0 */

  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;

  switch (p_event_pckt->evt)
  {
  case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
  {
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;

      if (p_disconnection_complete_event->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
      {
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
          BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
          APP_DBG_MSG(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE\n");
          APP_DBG_MSG("     - Connection Handle:   0x%x\n     - Reason:    0x%x\n\r",
                      p_disconnection_complete_event->Connection_Handle,
                      p_disconnection_complete_event->Reason);

          /* USER CODE BEGIN EVT_DISCONN_COMPLETE_2 */

          /* USER CODE END EVT_DISCONN_COMPLETE_2 */
      }

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */

      /* USER CODE END EVT_DISCONN_COMPLETE_1 */

      /* restart advertising */
      Adv_Request(APP_BLE_FAST_ADV);

      /**
       * SPECIFIC to P2P Server APP
       */
      HandleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
      HandleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
      P2PS_APP_Notification(&HandleNotification);

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */
         // Client koptu - derhal yeni advertising başlat
         APP_DBG_MSG("=== CLIENT KOPTU - YENİ ADVERTİSİNG BAŞLANIYOR ===\n");

         // Reset timer'ı durdur
         HW_TS_Stop(Reset_timer_Id);

         // Yeni isim üret
         Update_Device_Name_With_Counter();

         // Derhal advertising başlat (bekleme yok)
         Adv_Request(APP_BLE_FAST_ADV);

         // 1 dakikalık timer yeniden başlat
         HW_TS_Start(Reset_timer_Id, (60*1000*1000/CFG_TS_TICK_VAL));

         APP_DBG_MSG("Server hazır: %s\n", current_device_name);
         /* USER CODE END EVT_DISCONN_COMPLETE */
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */
  }

    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
#if (CFG_DEBUG_APP_TRACE != 0)
          p_connection_update_complete_event = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                       p_connection_update_complete_event->Conn_Interval*1.25,
                       p_connection_update_complete_event->Conn_Latency,
                       p_connection_update_complete_event->Supervision_Timeout*10);
#endif /* CFG_DEBUG_APP_TRACE != 0 */

